#include <iostream>
#include <cstdlib>
using namespace std;
/*獨角蟲需要12顆糖可以進化成鐵殼蛹，再進化成大針鋒要50顆，因以進化次數考量，
不會進化成大針鋒。給你文文目前所擁有的糖果及獨角蟲數量，
(假設文文已經把所有的鐵殼蛹或由它再進化而成的大針蜂 (Beedrill)傳送給教授以換取糖果了，
而且他會留下足夠的獨角蟲以儘可能進行最多的進化)，請你幫他計算一下他現在可以完成幾隻獨角蟲的進化。*/
int main()
{
	int c, w,success=0;/*c:candy count  w:Weedle數量*/
	cin >> c >> w;
	while (w >= 1)
	{
		if (c >= 12)
		{
			c = c-12+2;/*進化用12顆+進化成功1顆+傳送鐵甲蛹+顆*/
			w -= 1;/*進化用掉一隻獨角蟲*/
			success++;
			continue;//這次迴圈進化成功，重新判斷能不能再進化，策略是先把糖果用光再傳送未進化的蟲蟲
		}
		w -= 1; c += 1;/*糖果不夠，傳送獨角蟲*/
	}
	
	cout << success;
	/*公式解:success=(c + w - 2) / 11
	不要問我為什麼*/
}